In [1]:
import pandas as pd
import numpy as np

In [4]:
#dataframe (df) adalah struktur data tabular yang disusun pada kolom dan baris
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
#menampilkan dataframe
df

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061
E  1.032149 -0.777967 -1.481926  0.851492

In [6]:
#menampilkan data pada kolom W
df['W']

A    0.264476
B    0.186559
C   -1.210582
D    0.113755
E    1.032149
Name: W, dtype: float64

In [8]:
#menampilkan data pada kolom W (ini cara tidak disarankan)
df.W

A    0.264476
B    0.186559
C   -1.210582
D    0.113755
E    1.032149
Name: W, dtype: float64

In [10]:
#menampilkan 2 kolom dan disertai []2x
df[['W', 'Z']]

          W         Z
A  0.264476  0.146055
B  0.186559  0.154860
C -1.210582  1.772275
D  0.113755  1.203061
E  1.032149  0.851492

In [12]:
#menambahkan kolom baru bernama 'baru'
df['baru'] = df['W'] + df['Y']
df

          W         X         Y         Z      baru
A  0.264476  1.623015  0.389441  0.146055  0.653918
B  0.186559  0.696670 -0.827377  0.154860 -0.640817
C -1.210582  0.201420  0.111542  1.772275 -1.099040
D  0.113755 -1.482835  0.218625  1.203061  0.332380
E  1.032149 -0.777967 -1.481926  0.851492 -0.449777

In [13]:
#drop menghapus kolom
#'baru' adalah nama kolom dan axis adalah posisi tempat yang akan dihapus
#jika 0 = index, dan jika 1 = kolom
df.drop('baru',axis=1)

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061
E  1.032149 -0.777967 -1.481926  0.851492

In [14]:
#ketika dipanggil kembali kolom yang baru dihapus dan menampilkannya kembali
df

          W         X         Y         Z      baru
A  0.264476  1.623015  0.389441  0.146055  0.653918
B  0.186559  0.696670 -0.827377  0.154860 -0.640817
C -1.210582  0.201420  0.111542  1.772275 -1.099040
D  0.113755 -1.482835  0.218625  1.203061  0.332380
E  1.032149 -0.777967 -1.481926  0.851492 -0.449777

In [15]:
#ketika inplace True maka akan mengeksekusi secara langsung di tempat tapi tidak bisa langsung menampilkan datanya
df.drop('baru', axis=1, inplace=True)
df

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061
E  1.032149 -0.777967 -1.481926  0.851492

In [16]:
#menghapus baris E
df.drop('E',axis=0)
df

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061
E  1.032149 -0.777967 -1.481926  0.851492

In [29]:
df

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061

In [30]:
#A adalah nama index labels
df.loc['A']

W    0.264476
X    1.623015
Y    0.389441
Z    0.146055
Name: A, dtype: float64

In [31]:
#untuk mendapatkan data by index
df.iloc[2]

W   -1.210582
X    0.201420
Y    0.111542
Z    1.772275
Name: C, dtype: float64

In [34]:
#mendapatkan data terperinci
#mengambil data baris C dan kolom Z
df.loc['C','Z']

1.7722751714986513

In [35]:
#mengambilkan data baris A dan B, kolom W dan Y
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.264476  0.389441
B  0.186559 -0.827377

In [36]:
#menyeleksi data yang lebih dari 0
df > 0

       W      X      Y     Z
A   True   True   True  True
B   True   True  False  True
C  False   True   True  True
D   True  False   True  True

In [37]:
df[df>0]

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670       NaN  0.154860
C       NaN  0.201420  0.111542  1.772275
D  0.113755       NaN  0.218625  1.203061

In [38]:
#menampilkan data berdasarkan kolom W yang lebih dari 0
df[df['W']>0]

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
D  0.113755 -1.482835  0.218625  1.203061

In [39]:
#menampilkan data kolom Y berdasarkan pada kolom W yang lebih dari 0
df[df['W']>0]['Y']

A    0.389441
B   -0.827377
D    0.218625
Name: Y, dtype: float64

In [40]:
#menampilkan data kolom Y dan X berdasarkan pada kolom W yang lebih dari 0
df[df['W']>0][['Y','X']]

          Y         X
A  0.389441  1.623015
B -0.827377  0.696670
D  0.218625 -1.482835

In [41]:
#menampilkan data berdasarkan kolom W yang lebih dari 0 dan kolom X lebih dari 1
df[(df['W']>0) & (df['X'] > 1)]

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055

In [42]:
#menampilkan data berdasarkan kolom W yang lebih dari 0 atau kolom X lebih dari 0
df[(df['W']>0) | (df['X']>0)]

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061

In [43]:
#mereset index label menjadi index default
df.reset_index()

  index         W         X         Y         Z
0     A  0.264476  1.623015  0.389441  0.146055
1     B  0.186559  0.696670 -0.827377  0.154860
2     C -1.210582  0.201420  0.111542  1.772275
3     D  0.113755 -1.482835  0.218625  1.203061

In [52]:
df

          W         X         Y         Z
A  0.264476  1.623015  0.389441  0.146055
B  0.186559  0.696670 -0.827377  0.154860
C -1.210582  0.201420  0.111542  1.772275
D  0.113755 -1.482835  0.218625  1.203061

In [58]:
#membuat kolom baru
df["code"] = "IND JPN USA KOR".split()
df

          W         X         Y         Z code
A  0.264476  1.623015  0.389441  0.146055  IND
B  0.186559  0.696670 -0.827377  0.154860  JPN
C -1.210582  0.201420  0.111542  1.772275  USA
D  0.113755 -1.482835  0.218625  1.203061  KOR

In [78]:
#multi indexing
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))#zip menggabungkan 2 array atau lebih menjaadi beberapa tuple

data = pd.MultiIndex.from_tuples(data)

list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [79]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [80]:
#membuat sebuah dataframe baru dengan data random 6 baris 2 kolom
#index dari dataframe ini adalah variabel data karna terdapat 
#banyak data kembar maka data tersebut dikemas yaitu G1 dan G2
# dan  1 2 3 menjadi sub indexnya nama kolom A dan B
df = pd.DataFrame(np.random.randn(6,2),index=data, columns=['A','B'])
df

             A         B
G1 1 -1.844010  0.342651
   2 -0.364672  0.209119
   3  0.130689 -0.878025
G2 1 -0.430322 -1.360629
   2 -0.063952 -0.003482
   3  0.968586 -1.619919

In [81]:
#menampilkan index dari G1
df.loc['G1']

          A         B
1 -1.844010  0.342651
2 -0.364672  0.209119
3  0.130689 -0.878025

In [82]:
df.loc['G1'].loc[3]

A    0.130689
B   -0.878025
Name: 3, dtype: float64

In [83]:
#melihat nama index
df.index.names

FrozenList([None, None])

In [85]:
#merubah nama index
df.index.names = ['Group', 'Num']
df

                  A         B
Group Num
G1    1   -1.844010  0.342651
      2   -0.364672  0.209119
      3    0.130689 -0.878025
G2    1   -0.430322 -1.360629
      2   -0.063952 -0.003482
      3    0.968586 -1.619919

In [86]:
#XS : untuk menampilkan dataframe multiflex
df.xs('G1')

            A         B
Num
1   -1.844010  0.342651
2   -0.364672  0.209119
3    0.130689 -0.878025

In [87]:
#menampilkan index labels G2 dengan sub index 2
df.xs(['G2',2])

A   -0.063952
B   -0.003482
Name: (G2, 2), dtype: float64

In [88]:
#menampilkan sub index 1 dari kolom num
df.xs(1,level = 'Num')

              A         B
Group
G1    -1.844010  0.342651
G2    -0.430322 -1.360629